[
  {
    "title": "Classic Blue Suit Ensemble",
    "gender": "Male",
    "style": "Formal Two-Piece Suit",
    "color": "Royal Blue",
    "event": "Weddings, Corporate Events, and Formal Gatherings",
    "priceRange": "KSH 10,000 - KSH 14,000",
    "material": "Premium Wool Blend",
    "sizes": ["S", "M", "L", "XL", "XXL"],
    "image": "https://i.postimg.cc/yxvj27sK/image.png",
    "description": "An elegant royal blue two-piece suit tailored from a premium wool blend for lasting comfort and style. The slim-fit design creates a modern, confident silhouette, making it ideal for weddings, corporate events, and any formal occasion that calls for sophistication."
  },
  {
    "title": "Black African-Inspired Men's Set",
    "gender": "Male",
    "style": "Traditional African Long-Sleeve Shirt and Trouser Set",
    "color": "Black with Multicolor Accents",
    "event": "Cultural Celebrations, Weddings, Formal Gatherings, and Church Events",
    "priceRange": "KSH 6,000 - KSH 8,500",
    "material": "High-Quality Cotton Blend",
    "sizes": ["M", "L", "XL", "XXL"],
    "image": "https://i.postimg.cc/jjp2z1wQ/Whats-App-Image-2025-10-22-at-19-03-09-460801aa.jpg",
    "description": "A stylish black two-piece outfit featuring a long-sleeve African-inspired shirt with multicolor patterned accents along the chest and placket. Tailored from a comfortable cotton blend for breathability and a refined fit, this ensemble blends tradition with modern fashion. Ideal for cultural events, weddings, and formal gatherings where elegance meets heritage."
  },
  {
    "title": "Golden Tan Wedding Suit Set",
    "gender": "Male",
    "style": "Three-Piece Formal Suit",
    "color": "Golden Tan with Green Accents",
    "event": "Weddings, Formal Receptions, and Celebratory Events",
    "priceRange": "KSH 11,000 - KSH 15,000",
    "material": "High-Quality Polyester and Wool Blend",
    "sizes": ["S", "M", "L", "XL", "XXL"],
    "image": "https://i.postimg.cc/WpXjVKpT/Whats-App-Image-2025-10-22-at-19-03-10-30338a95.jpg",
    "description": "A refined golden tan three-piece suit designed for weddings and elegant occasions. Featuring a tailored fit, matching vest, and green tie accent, this ensemble radiates confidence and modern sophistication. Crafted from a durable wool-polyester blend that ensures comfort and a crisp finish, making it a top choice for groomsmen or formal event wear."
  },
  {
    "title": "Royal Blue Groomsmen Suit Set",
    "gender": "Male",
    "style": "Formal Three-Piece Suit with Vest",
    "color": "Royal Blue with White Shirt and Peach Tie",
    "event": "Weddings, Engagements, and Formal Receptions",
    "priceRange": "KSH 10,500 - KSH 13,500",
    "material": "Wool-Blend and Polyester",
    "sizes": ["S", "M", "L", "XL", "XXL"],
    "image": "https://i.postimg.cc/DzH617ck/Whats-App-Image-2025-10-22-at-19-03-13-fce00e5b.jpg",
    "description": "A coordinated royal blue three-piece groomsmen suit featuring a vest, matching trousers, and a crisp white shirt paired with a peach tie. Tailored for comfort and modern elegance, this ensemble blends classic wedding formality with a youthful, stylish edge — ideal for groomsmen or formal ceremonies."
  },
  {
    "title": "Chocolate Brown Executive Suit",
    "gender": "Male",
    "style": "Two-Piece Formal Suit with Patterned Tie",
    "color": "Deep Chocolate Brown with Pink Shirt and Red Paisley Tie",
    "event": "Corporate Functions, Formal Meetings, and Elegant Celebrations",
    "priceRange": "KSH 9,000 - KSH 12,500",
    "material": "Premium Wool-Blend Fabric",
    "sizes": ["S", "M", "L", "XL"],
    "image": "https://i.postimg.cc/1RjFtvJ9/Whats-App-Image-2025-10-22-at-19-03-13-3da23731.jpg",
    "description": "A sophisticated deep brown formal suit paired with a pink shirt and a bold red paisley tie. Designed with a slim, confident fit and fine tailoring for comfort and class. Ideal for executives, formal occasions, and stylish events where modern charm meets timeless professionalism."
  },
  {
    "title": "Elegant Mauve and Pinstripe Couple Set",
    "gender": "Couple",
    "style": "Coordinated Formal and African-Inspired Outfits",
    "color": "Mauve Purple and Charcoal Black with Pinstripes",
    "event": "Engagements, Weddings, Corporate Photoshoots, and Cultural Celebrations",
    "priceRange": "KSH 15,000 - KSH 22,000 (Full Set)",
    "material": "Wool-Blend Suit and Cotton African Fabric",
    "sizes": ["S", "M", "L", "XL"],
    "image": "https://i.postimg.cc/4dndRgCt/Whats-App-Image-2025-10-22-at-19-03-16-fb7f1519.jpg",
    "description": "A beautifully coordinated couple outfit featuring a sleek black pinstripe double-breasted suit paired with a lavender shirt and printed tie, complemented by a stylish mauve African-inspired two-piece set with gold button accents. This ensemble exudes elegance, harmony, and sophistication — perfect for couples attending weddings, engagements, or formal occasions that celebrate culture and style."
  },
  {
    "title": "Classic White and Sage Green Wedding Couple Set",
    "gender": "Couple",
    "style": "Wedding Dress and Groom's Suit Ensemble",
    "color": "White and Sage Green with Cream Bowtie",
    "event": "Weddings, Engagements, and Bridal Photoshoots",
    "priceRange": "KSH 25,000 - KSH 35,000 (Full Set)",
    "material": "Satin Bridal Fabric and Wool-Blend Suit Material",
    "sizes": ["S", "M", "L", "XL"],
    "image": "https://i.postimg.cc/5t2KBxQz/Whats-App-Image-2025-10-22-at-19-03-23-fd98ff3e.jpg",
    "description": "A timeless wedding couple ensemble featuring a graceful white satin bridal gown with elegant detailing, paired with a sage green tailored suit accented by a cream bowtie. The combination radiates love and sophistication — ideal for weddings, couple photoshoots, and elegant ceremonies set in serene outdoor settings."
  },
  {
    "title": "Royal Blue and Blush Pink Wedding Ensemble",
    "gender": "Couple & Group",
    "style": "Bridal Gown, Groom's Suit, Bridesmaids & Groomsmen Attire",
    "color": "White, Royal Blue, and Blush Pink",
    "event": "Weddings, Bridal Photoshoots, and Luxury Receptions",
    "priceRange": "KSH 40,000 - KSH 70,000 (Full Ensemble)",
    "material": "Satin, Wool-Blend, and Chiffon",
    "sizes": ["S", "M", "L", "XL", "XXL"],
    "image": "https://i.postimg.cc/6qTFKCXp/Whats-App-Image-2025-10-22-at-19-08-10-fb3d1bd4.jpg",
    "description": "A breathtaking wedding ensemble featuring a white satin bridal gown with a voluminous train, paired with a groom's double-breasted royal blue suit accented by a white jacket. The bridesmaids complement the scene in elegant blush pink off-shoulder gowns, while the groomsmen wear matching royal blue suits. This coordinated set embodies luxury, elegance, and timeless harmony — perfect for grand weddings and bridal photoshoots."
  },
  {
    "title": "Boys' Sage Green and Black Formal Set",
    "gender": "Kids",
    "style": "Two-Piece Formal Suit with Bowtie",
    "color": "Sage Green Vest and Black Trousers with White Shirt",
    "event": "Weddings, Family Photoshoots, Church Events, and Formal Celebrations",
    "priceRange": "KSH 5,000 - KSH 7,500 (Per Set)",
    "material": "Cotton-Polyester Blend",
    "sizes": ["Kids XS", "Kids S", "Kids M", "Kids L"],
    "image": "https://i.postimg.cc/G3xYCv5v/Whats-App-Image-2025-10-22-at-19-03-24-1a8babc7.jpg",
    "description": "A charming kids' formal set featuring a sage green vest with gold buttons, a white shirt, black trousers, and a matching bowtie. Designed for comfort and cuteness, this coordinated look is perfect for weddings, family portraits, church functions, and special occasions where young gentlemen shine."
  },
  {
    "title": "Forest Green and Khaki Groomsmen Set",
    "gender": "Male",
    "style": "Semi-Formal Wedding Suit Ensemble",
    "color": "Forest Green Blazer, White Shirt, and Khaki Trousers",
    "event": "Weddings, Receptions, and Outdoor Ceremonies",
    "priceRange": "KSH 9,500 - KSH 12,500 (Per Outfit)",
    "material": "Cotton and Wool-Blend Fabric",
    "sizes": ["M", "L", "XL", "XXL"],
    "image": "https://i.postimg.cc/0ys7Rc8m/Whats-App-Image-2025-10-22-at-19-03-27-2c69a8ad.jpg",
    "description": "A coordinated groomsmen ensemble featuring a deep forest green blazer paired with a crisp white shirt and khaki trousers. This look blends classic wedding style with natural tones, making it ideal for outdoor ceremonies, receptions, or garden weddings. Comfortable, stylish, and perfectly tailored for an elegant wedding party aesthetic."
  },
  {
    "title": "Teal Blue Senator Men's Attire",
    "gender": "Male",
    "style": "Modern African Senator Outfit",
    "color": "Teal Blue with Black Placket Accent",
    "event": "Cultural Events, Weddings, Church, and Formal Gatherings",
    "priceRange": "KSH 6,500 - KSH 9,500",
    "material": "Premium Cotton-Polyester Blend",
    "sizes": ["M", "L", "XL", "XXL"],
    "image": "https://i.postimg.cc/vBF4fmcc/image.png",
    "description": "A sleek modern senator-style outfit in deep teal blue with a contrasting black placket. Crafted from a soft, breathable cotton-polyester blend for both comfort and elegance. Perfect for cultural occasions, weddings, or formal gatherings where simplicity meets class."
  },
  {
    "title": "Teal Blue African Formal Men's Set",
    "gender": "Male",
    "style": "Tailored Two-Piece African Suit",
    "color": "Teal Blue",
    "event": "Weddings, Cultural Events, Church, and Corporate Functions",
    "priceRange": "KSH 7,000 - KSH 9,500",
    "material": "Premium Cotton Fabric",
    "sizes": ["M", "L", "XL", "XXL"],
    "image": "https://i.postimg.cc/gkQLm4m3/Whats-App-Image-2025-10-22-at-19-03-33-60005ac4.jpg",
    "description": "A stylish tailored teal blue African-inspired outfit featuring a long-sleeve button-up shirt with matching trousers. The slim-fit design highlights modern African fashion with subtle traditional influences, offering both elegance and comfort. Perfect for weddings, cultural occasions, church services, or semi-formal gatherings."
  },
  {
    "title": "Navy Blue Short-Sleeve African Suit",
    "gender": "Male",
    "style": "Short-Sleeve Tailored African Suit",
    "color": "Navy Blue",
    "event": "Cultural Events, Weddings, Corporate Gatherings, and Smart Casual Occasions",
    "priceRange": "KSH 7,500 - KSH 10,000",
    "material": "Textured Wool-Blend Fabric",
    "sizes": ["M", "L", "XL", "XXL"],
    "image": "https://i.postimg.cc/WzjLMBGJ/Whats-App-Image-2025-10-22-at-19-03-34-5c777f8d.jpg",
    "description": "A refined navy blue short-sleeve African suit tailored for modern elegance. Featuring structured button detailing and dual front pockets, this outfit combines traditional craftsmanship with contemporary styling. Perfect for weddings, business events, and semi-formal occasions that call for a balance of culture and class."
  },
  {
    "title": "Olive Green African Executive Set",
    "gender": "Male",
    "style": "Long-Sleeve Tailored African Suit",
    "color": "Olive Green with Dark Trim Accents",
    "event": "Cultural Events, Office Wear, Weddings, and Special Occasions",
    "priceRange": "KSH 7,500 - KSH 10,500",
    "material": "Soft Cotton-Blend Fabric",
    "sizes": ["M", "L", "XL", "XXL"],
    "image": "https://i.postimg.cc/pTQXbYkY/Whats-App-Image-2025-10-22-at-19-03-36-2fdfec8c.jpg",
    "description": "A sophisticated olive green African-inspired set featuring a long-sleeve shirt and matching trousers. Designed with flap pockets and dark accent trims for a modern executive finish, this outfit offers both cultural flair and contemporary style. Ideal for weddings, office wear, or smart casual events."
  },
  {
    "title": "Khaki Short-Sleeve African Men's Set",
    "gender": "Male",
    "style": "Short-Sleeve Tailored African Suit",
    "color": "Light Khaki Brown",
    "event": "Cultural Events, Office Wear, Semi-Formal Occasions, and Weddings",
    "priceRange": "KSH 6,500 - KSH 9,000",
    "material": "Soft Cotton-Linen Blend",
    "sizes": ["M", "L", "XL", "XXL"],
    "image": "https://i.postimg.cc/QN9ZTqck/Whats-App-Image-2025-10-22-at-19-03-37-dff29ce7.jpg",
    "description": "A stylish khaki short-sleeve African-inspired outfit featuring a button-up shirt with structured flap pockets and a tailored matching trouser. Designed from a breathable cotton-linen blend, this ensemble blends traditional elegance with contemporary charm — perfect for weddings, cultural events, or casual business occasions."
  },
  {
    "title": "Classic Gray Women's Power Suit",
    "gender": "Female",
    "style": "Formal Blazer and Trouser Set",
    "color": "Charcoal Gray with White Inner Top",
    "event": "Corporate Events, Office Wear, Business Meetings, and Formal Occasions",
    "priceRange": "KSH 9,500 - KSH 13,000",
    "material": "Wool-Blend with Soft Polyester Lining",
    "sizes": ["S", "M", "L", "XL"],
    "image": "https://i.postimg.cc/6qYZwNzm/Whats-App-Image-2025-10-22-at-19-03-38-bd97d885.jpg",
    "description": "A refined and elegant women's formal suit featuring a tailored gray blazer and fitted trousers paired with a classic white top. Designed for modern professionals, this outfit combines confidence, sophistication, and comfort, making it ideal for office wear, business meetings, or high-profile corporate events."
  },
  {
    "title": "Vibrant Purple Women's Executive Suit",
    "gender": "Female",
    "style": "Formal Blazer and Trouser Set",
    "color": "Royal Purple with White Inner Shirt",
    "event": "Corporate Events, Business Meetings, Office Wear, and Formal Occasions",
    "priceRange": "KSH 10,000 - KSH 14,000",
    "material": "High-Quality Stretch Wool Blend",
    "sizes": ["S", "M", "L", "XL"],
    "image": "https://i.postimg.cc/hhWkSHjQ/Whats-App-Image-2025-10-22-at-19-03-38-48f01e8c.jpg",
    "description": "A bold and modern women's executive suit in royal purple, designed to command attention and exude confidence. Featuring a tailored blazer and fitted trousers paired with a crisp white shirt, this ensemble blends power and sophistication — perfect for business leaders, formal presentations, or professional gatherings."
  },
  {
    "title": "Royal Blue Women's Business Suit",
    "gender": "Female",
    "style": "Formal Blazer and Trouser Set",
    "color": "Royal Blue with White Inner Shirt",
    "event": "Corporate Functions, Business Meetings, Conferences, and Formal Occasions",
    "priceRange": "KSH 10,000 - KSH 14,000",
    "material": "High-Quality Wool-Blend Fabric",
    "sizes": ["S", "M", "L", "XL"],
    "image": "https://i.postimg.cc/CxH30hqj/Whats-App-Image-2025-10-22-at-19-08-07-acd5d05d.jpg",
    "description": "An exquisite royal blue women's business suit designed to embody confidence and sophistication. Featuring a tailored-fit blazer and slim trousers paired with a crisp white shirt, this ensemble reflects modern professionalism and elegance. Ideal for corporate leaders, presentations, and formal events where poise and presence are key."
  },
  {
    "title": "Navy Blue Women's Corporate Suit",
    "gender": "Female",
    "style": "Formal Blazer and Trouser Set",
    "color": "Deep Navy Blue with White Inner Shirt",
    "event": "Corporate Meetings, Conferences, Office Wear, and Formal Events",
    "priceRange": "KSH 10,000 - KSH 13,500",
    "material": "Wool-Blend with Soft Satin Lining",
    "sizes": ["S", "M", "L", "XL"],
    "image": "https://i.postimg.cc/R0bdwyt1/Whats-App-Image-2025-10-22-at-19-08-08-9cb6cd9f.jpg",
    "description": "An elegant navy blue women's formal suit featuring a structured blazer and slim trousers paired with a crisp white shirt. Designed for the modern professional, this outfit conveys authority and grace while maintaining comfort throughout the day. Ideal for board meetings, office wear, and formal business functions."
  }
]
